#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


  # module.KEYCLOAK_DEV.module.moh_applications.module.HCAP-FE.module.client-roles.keycloak_role.ROLES["superuser"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "superuser"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.HCAP-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/manage-user-roles"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "f539f4bf-ba7a-4ba3-a8d4-a47f786e205d"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.HCAP-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-hcap-fe"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.HCAP-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-clients"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "8742c7c0-664c-4321-8225-f70420d299f7"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.HCAP-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-users"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "beddbeb0-650e-4bd9-8484-d05f789c61b6"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.HCAP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.HCAP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/manage-user-roles"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "2ddc7173-34f3-41ff-9beb-66c7802717ce"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "manage-user-roles"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.HCAP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-client-hcap-fe"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "2ddc7173-34f3-41ff-9beb-66c7802717ce"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-client-hcap-fe"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.HCAP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-clients"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "2ddc7173-34f3-41ff-9beb-66c7802717ce"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-clients"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.HCAP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-users"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "2ddc7173-34f3-41ff-9beb-66c7802717ce"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-users"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-hcap-fe"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "2ddc7173-34f3-41ff-9beb-66c7802717ce"
      + id        = (known after apply)
      + name      = "view-client-hcap-fe"
      + realm_id  = "moh_applications"
    }

Plan: 26 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @sharpedavid, Action: `pull_request`*